<?php
include 'class.php';
$init = new RndyTech;
echo
"

__        __   _
\ \      / /__| | ___ ___  _ __ ___   ___
 \ \ /\ / / _ \ |/ __/ _ \| '_ ` _ \ / _ \
  \ V  V /  __/ | (_| (_) | | | | | |  __/
   \_/\_/ \___|_|\___\___/|_| |_| |_|\___|
   
ㅤ _   _       ____                        __  __ _
ㅤ| \ | | __ _/ ___| _ __   __ _ _ __ ___ |  \/  / |
ㅤ|  \| |/ _` \___ \| '_ \ / _` | '_ ` _ \| |\/| | |
ㅤ| |\  | (_| |___) | |_) | (_| | | | | | | |  | | |
ㅤ|_| \_|\__, |____/| .__/ \__,_|_| |_| |_|_|  |_|_|
ㅤ       |___/      |_|

ㅤ ____          __  __ _____ ____
ㅤ| __ ) _   _  |  \/  |_   _/ ___|
ㅤ|  _ \| | | | | |\/| | | | \___ \
ㅤ| |_) | |_| | | |  | | | |  ___) |
ㅤ|____/ \__, | |_|  |_| |_| |____/
ㅤ       |___/           

ㅤ___   ___  ___   ___  ___  _  ___  ____   __    ___ ____
 / _ \ ( _ )/ _ \ ( _ )/ _ \/ |/ _ \| ___| / /_  ( _ ) ___|
| | | |/ _ \ (_) |/ _ \ (_) | | | | |___ \| '_ \ / _ \___ \
| |_| | (_) \__, | (_) \__, | | |_| |___) | (_) | (_) |__) |
 \___/ \___/  /_/ \___/  /_/|_|\___/|____/ \___/ \___/____/

=====================================
NAMA - NAMA CODE & TAMPILAN NYA
CODE | NAMA TAMPILAN
ㅤG  = Codashop FF Log FB Only
ㅤV  = MediaFire
ㅤM  = Mobile Legends
=====================================
copyright ©2022 MTShost
=====================================
DI GUNAKAN SECUKUPNYA JANGAN SAMPE JEBOL
SMTP MU BROH(•‿•)

";
echo "\n";
$z = 0;
$h = "\e[0;32m";
$p = "\e[1;37m";
sleep(2);
echo "╔╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤\n";
echo "╟\n";
echo "╟> URL  >_: ";
$website = trim(fgets(STDIN));
echo "╟> Msg  >_: ";
$pesan = trim(fgets(STDIN));
echo "╟> Amount  >_: ";
$batas = trim(fgets(STDIN));
echo "╟\n";
echo "╟\n";
echo "╚╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧\n";
echo "╔╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤\n";
echo "╟\n";
echo "╟> URL : $website \n";
echo "╟> Ip Address : 40.83.78.143 \n";
echo "╟> Status : 200 \n";
echo "╟> Reason : OK \n";
echo "╟> Able To Spam : $h Yes $p\n";
echo "╟\n";
echo "╚╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧\n";
echo "╔╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤╤\n";
echo "╟\n";
echo "╟> Continue Spam Y/N : ";
$Jwb = trim(fgets(STDIN));
echo "╟\n";
echo "╚╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧╧\n";
sleep(2);
$y = 1;
$msg = "AutoRessByRndyTech";
while($y <= $batas)
{
    echo ''.$init->RndySpam($website,$msg);
    if($y == $batas){
    echo "+\n";
    echo "=> $batas Result Terkirim ® RndyTech \n";
    echo "+\n";
    echo "+++++++++++++++++++++++++++++++++++++++++++++++++++\n";
    }
 $y++;
}
?>